[
  {
    "title": "Its nothing here right now.",
    "subtitle": "Probably you should go away...",
    "content": "Hey, I am Dawid Pura and I will post here some programming stuff, my thoughts and more! Just you have to wait for it for a _while_. I can't work all day on this easy framework :P"
  },
  {
    "title": "Scalar",
    "subtitle": "Nothing",
    "content": "Scalar Conference 2016\n======================\n\nI have never been at previous Scalar Conferences (which were in 2014 and 2015) and I am not a Scala professional at all (however, knowledge about basic syntax, the idea of language and writing some basic Play applications were in my head since last year). I thought that would be fine to get to the conference and have a great time Did that, been there ;) Let's review whole event from the beginning to the end. \n\nWho and what?\n-------------\n\nScalar is and was organized by not big (I think there are about 30 people right now) but technologically and PR strong company which is SoftwareMill (greetings by the way!). All of presentations are English-spoken so there is nice possibility to come from other countries and people that doesn't use Polish (obviously) - and, in fact, they did.\nThe topic of event is about using Scala (or functional programming), its tooling and other related Scala-similar things.\n\nRegistration\n------------\n\nI knew that I want to go. So where I have to sign in? There was a simple form to register, give some basic data about you and experience with Scala you have, T-shirt size (but it wasn't really useful) and wait for lottery. That sounds fun but what if the experienced Scala programmer can't take apart because of lame (like me) that have been chosen. I think it was more complex than that, because I received a mail I can participate about week before (too late, if I didn't get lucky I might have some plans that weekend). So probably I get a place because one of the luckiest can't go in the first place. Looks more legitimate :)\n\nThe Event\n---------\n\nBialystok is a fucking small city (300k people are living there). Its placed about 200 kilometers to Warsaw and have no airport or similar thing (teleporters, Hyperloop?!) that make me sad every day. Why? I have to travel to Warsaw at least 2 hours and 30 minutes (still, if I get lucky and take the train). Then I can get a flight. But this time I did not need any additional travel, just picked up the train and go far far away (200 kilometers...).\nThe place was really nice. It was based in first floor on Museum of Polish Jews at Anielewicza 6. Conference room looks business class (BoilingFrogs' place this year was quite similar in this case) so it was nice, there was a coffee and cookies so that is another advantage :). Because of those fucking trains I get to conference far too late (about 9:30 and event started about 8:00) so I have a little time to drink coffee and think about why I am here before next presentation will start.\n"
  }
]
